<html><head>
      <meta http-equiv="Content-Type" content="text/html; charset=ISO-8859-1">
   <title>POO - Projet de fin de premier semestre BTS IG</title><meta name="generator" content="DocBook XSL Stylesheets V0"></head><body bgcolor="white" text="black" link="#0000FF" vlink="#840084" alink="#0000FF"><div class="article"><div class="titlepage"><div><h1 class="title"><a name="index"></a>POO - Projet de fin de premier semestre BTS IG</h1></div><div><div class="author"><h3 class="author">Olivier Capuozzo</h3><div class="affiliation"><div class="address"><p><tt>&lt;<a href="mailto:kpu@compuserve.com">kpu@compuserve.com</a>&gt;</tt></p></div></div></div></div><div><div class="author"><h3 class="author">Lyc&eacute;e L&eacute;onard de Vinci 77000 Melun</h3></div></div><div><p class="pubdate">17-dec-2002</p></div><div><div class="abstract"><p class="title"><b>R&eacute;sum&eacute;</b></p><p>Projet de fin de premier semestre, &agrave; destination des &eacute;tudiants BTS IG, section IG12, du lyc&eacute;e L&eacute;onarde de Vinci, Melun.</p><p>Ce projet est r&eacute;alis&eacute; seul ou par &eacute;quipe de deux, durant les cong&eacute;s de No&euml;l, ann&eacute;e scolaire 2002-2003.</p><p>Ce document &agrave; &eacute;t&eacute; r&eacute;alis&eacute; sous Linux avec <a href="http://www.vim.org" target="_top">gvim</a>, au format <a href="http://www.oasis-open.org/docbook/" target="_top"> docbook </a>, et mise en page avec XSLT et les feuilles de styles de  <a href="http://nwalsh.com/" target="_top">Norman Walsh</a>.</p><p></p></div></div><hr></div><div class="toc"><p><b>Table des mati&egrave;res</b></p><dl><dt><a href="#d0e45">Pr&eacute;sentation du projet</a></dt><dd><dl><dt><a href="#d0e205">Positionnement des objets</a></dt><dt><a href="#d0e253">Autres caract&eacute;ristiques des objets</a></dt></dl></dd><dt><a href="#d0e312">Votre travail</a></dt><dt><a href="#d0e406">Crit&egrave;res d'&eacute;valuation de votre travail</a></dt><dt><a href="#d0e437">A RENDRE LE 06 JANVIER 2002</a></dt><dt><a href="#d0e444">Le code source</a></dt></dl></div><div class="sect1"><div class="titlepage"><div><h2 class="title" style="clear: both"><a name="d0e45"></a>Pr&eacute;sentation du projet</h2></div></div><p>On vous demande de concevoir un <b>G&Eacute;N&Eacute;RATEUR DE PAYSAGES VIRTUELS</b> en <b>java</b>, avec l'API (<i>application programming interface</i>) <b>swing</b>. </p><p><b>Vous est fourni :</b></p><div class="itemizedlist"><ul type="disc"><li><p>Un squelette architectural de l'application &agrave; respecter <b>imp&eacute;rativement</b>.</p></li><li><p>Un shell script de compilation et de g&eacute;n&eacute;ration d'un <b>jar</b> (<tt>build.sh</tt>). </p></li><li><p>Le fichier <tt>manifest</tt> qui convient pour rendre ex&eacute;cutable le fichier <tt>paysage.jar</tt>.</p></li><li><p>Un gestionnaire de positionnement (<tt>PaysageLayout.java</tt>) qui positionne automatiquement les objets de votre paysage lorsque la dimension de la fen&ecirc;tre principale change.</p></li><li><p>Les classes </p><div class="itemizedlist"><ul type="round"><li><p><tt>Paysage</tt></p><p>Source : <tt>Paysage.java</tt></p><p>Responsabilit&eacute;s : G&eacute;n&eacute;rateur de paysage al&eacute;atoire.</p><p>Remarque : N&eacute;cessitera des am&eacute;nagements afin d'int&eacute;grer votre production.</p></li><li><p><tt>ObjetDessin</tt></p><p>Source : <tt>ObjetDessin.java</tt></p><p>Responsabilit&eacute;s : Un mod&egrave;le mour tout objet pr&eacute;sent et futur du paysage.</p><p>Remarque : Une classe abstraite qui factorise le comportement commun de tout objet dans le paysage.</p></li><li><p><tt>Immeuble</tt></p><p>Source : <tt>Immeuble.java</tt></p><p>Responsabilit&eacute;s : Repr&eacute;sente un "immeuble" dans le paysage (nbEtages, nbFenetres par &eacute;tage, couleur param&eacute;trables).</p><p>Remarque : Une classe enfant de <tt>ObjetDessin</tt>.</p></li><li><p><tt>Planete</tt></p><p>Source : <tt>Planete.java</tt></p><p>Responsabilit&eacute;s : Repr&eacute;sente une "plan&egrave;te" dans le paysage.</p><p>Remarque : Une classe enfant de <tt>ObjetDessin</tt>.</p></li></ul></div></li></ul></div><p>Exemple d'utilisation de l'existant :</p><p>Compilation : </p><table border="0" bgcolor="#E0E0E0" width="100%"><tr><td><pre class="programlisting">
    ./build.sh
  </pre></td></tr></table><p>Ex&eacute;cution : </p><table border="0" bgcolor="#E0E0E0" width="100%"><tr><td><pre class="programlisting">
    java -jar paysage.jar
  </pre></td></tr></table><p>Exemple de r&eacute;sultat :</p><div class="mediaobject"><img src="paysage.jpg"></div><p>Remarque : <tt>build.sh</tt> compile <b>toutes</b> les classes du projet <b>puis</b> construit le fichier de d&eacute;ploiement (<tt>paysage.jar</tt>). En <b>phase de test</b>, pour ne compiler qu'<b>une</b> seule classe, vous pouvez utiliser la commande : </p><table border="0" bgcolor="#E0E0E0" width="100%"><tr><td><pre class="programlisting">
    javac Soleil.java -d .
  </pre></td></tr></table><p>Attention, ne pas oublier les arguments <tt>-d .</tt> afin de placer le fichier compil&eacute; (<tt>Soleil.class</tt>) au bon endroit. Il ne doit exister aucun <tt>.class</tt> dans le m&ecirc;me r&eacute;pertoire que les sources (<tt>.java</tt>), si c'est le cas (mauvaise manipulation de votre part), supprimez-les.</p><div class="sect2"><div class="titlepage"><div><h3 class="title"><a name="d0e205"></a>Positionnement des objets</h3></div></div><div class="itemizedlist"><ul type="disc"><li><p>La position en <b>x</b> des objets est d&eacute;termin&eacute;e &agrave; la cr&eacute;ation de l'objet (voir la m&eacute;thode <tt>init</tt> dans <tt>Paysage.java</tt>).</p></li><li><p>La position en <b>y</b> est calcul&eacute;e par la m&eacute;thode <tt>placeToi(int horizon)</tt> d&eacute;finie dans la classe abstraite <tt>ObjetDessin</tt> et actionn&eacute;e par le gestionnaire de positionnement <tt>PaysageLayout</tt>. Le param&egrave;tre <tt>horizon</tt> correspond &agrave; la coordonn&eacute;e en <b>y</b> du bas de la fen&ecirc;tre.</p><p>Par d&eacute;faut les objets sont au bas de la fen&ecirc;tre (simulaton d'une pesanteur). Pour les d&eacute;coller du bas de la fen&ecirc;tre, vous donnez, &agrave; chacun, une valeur de <tt>deltaHorizon</tt> (un attribut d'objet) qui soit sup&eacute;rieure &agrave; z&eacute;ro. Voir un exemple de cette technique au moment de la cr&eacute;ation de la plan&egrave;te dans <tt>Paysage.java</tt> o&ugrave; le dernier argument (50) correspond &agrave; la valeur de ce de <tt>deltaHorizon</tt>. </p></li></ul></div></div><div class="sect2"><div class="titlepage"><div><h3 class="title"><a name="d0e253"></a>Autres caract&eacute;ristiques des objets</h3></div></div><div class="itemizedlist"><ul type="disc"><li><p>Dimensions</p><p>Elles sont d&eacute;termin&eacute;es <b>al&eacute;atoirement</b> par le g&eacute;n&eacute;rateur de paysage (m&eacute;thode <tt>init</tt> de <tt>Paysage</tt>). </p></li><li><p>Couleur des objets</p><p>D&eacute;termin&eacute;e <b>al&eacute;atoirement</b> par le g&eacute;n&eacute;rateur de paysage (m&eacute;thode <tt>init</tt> de <tt>Paysage</tt>).</p><p>Attention, les objets doivent conna&icirc;tre la couleur de fond afin de mieux se <i>fondre dans le paysage</i>. Ceci est d&eacute;j&agrave; pris en compte par la classe abstraite  <tt>ObjetDessin</tt> et ses attributs <tt>this.couleurTrait</tt> et <tt>this.couleurFond</tt>.</p></li><li><p>Positionnement des objets entre eux.</p><p>Sous la responsabilit&eacute; du gestionnaire de postionnement <tt>PaysageLayout</tt> qui, en l'&eacute;tat, dessine en premier la (ou les) plan&egrave;te(s), <b>puis</b> les immeubles.</p><p>Vous devrez donc intervenir sur cette classe afin qu'elle puisse prendre en compte vos cr&eacute;ations (nouvelles classes).</p></li></ul></div></div></div><div class="sect1"><div class="titlepage"><div><h2 class="title" style="clear: both"><a name="d0e312"></a>Votre travail</h2></div></div><p>Ce que l'on attend de vous :</p><div class="orderedlist"><ol type="1"><li><p>Un diagramme d'architecture <b>UML</b> de votre application dans son ensemble, sous la forme d'un diagramme de classes, &agrave; l'image du diagramme de classes du zoo et les animaux, mais en un peu plus d&eacute;taill&eacute; (pr&eacute;senter les attributs et m&eacute;thodes mais pas les accesseurs).</p></li><li><p>Cr&eacute;er un <b>menu</b> pour la <b>sauvegarde</b> et la <b>restauration</b> d'un paysage.</p><p>Puis vous ajouterez une entr&eacute;e <b>A propos</b> qui pr&eacute;sente votre projet (origne du projet, vos noms et pr&eacute;noms, date...) </p><p>Extra : Vous pouvez ajouter un menu "param&egrave;tres", pour le nombre de plan&egrave;te, coordonn&eacute;es, etc.</p></li><li><p>Concevoir une classe <b>Soleil</b>, descendant de <tt>ObjetDessin</tt>, repr&eacute;sentant un... soleil.</p><p>Ajouter une instance de votre classe <tt>Soleil</tt> dans le paysage.</p></li><li><p>Concevoir un nouvel <b>objet terrestre</b> de votre choix, dont la classe est un descendant de <tt>ObjetDessin</tt>.</p></li></ol></div><p>Vous livrerez un rapport, format HTML, compos&eacute; de <b>3 minumum &agrave; 4 pages maximum, </b>contenant :</p><div class="itemizedlist"><ul type="disc"><li><p>Un document d'analyse des points qui vous ont parus sensibles, <b>extraits de m&eacute;thodes</b> et <b>commentaires</b> associ&eacute;es (descriptif du probl&egrave;me et de la solution retenue), <b>diagramme de classes UML</b>, et <b>copies &eacute;cran</b> de votre oeuvre. </p></li><li><p><b>Code source</b> de votre application (sur <b>disquette</b>). Les nouvelles classes devront int&eacute;grer en commentaire vos noms et date de cr&eacute;ation.</p></li></ul></div><p>Sous Linux vous pouvez utiliser <tt>Netscape Composer</tt> comme &eacute;diteur HTML, <tt>dia</tt> comme &eacute;diteur de diagramme UML et <tt>gimp</tt> pour les copies &eacute;cran.</p></div><div class="sect1"><div class="titlepage"><div><h2 class="title" style="clear: both"><a name="d0e406"></a>Crit&egrave;res d'&eacute;valuation de votre travail</h2></div></div><p>Seront particuli&egrave;rement appr&eacute;ci&eacute;s</p><div class="itemizedlist"><ul type="disc"><li><p>L'originalit&eacute; et qualit&eacute; de vos apports. (<b>10 points</b>)</p></li><li><p>La qualit&eacute; de la documentation externe : Rapport HTML et diagramme UML. (<b>5 points</b>)</p></li><li><p>La qualit&eacute; de la documentation interne : Indentation, choix des noms de variable, identificateurs, commentaires dans le code. (<b>5 points</b>)</p></li></ul></div><div class="note" style="margin-left: 0.5in; margin-right: 0.5in;"><table border="1" width="80%"><tr><td rowspan="2" align="center" valign="top" width="25"><img src="images/note.png"></td><td>Bon &agrave; savoir</td></tr><tr><td colspan="1" align="left" valign="top"><p>Les projets feront l'objet d'un vote de la classe.</p><p>Les meilleurs projets seront publi&eacute;s sur le net.</p></td></tr></table></div></div><div class="sect1"><div class="titlepage"><div><h2 class="title" style="clear: both"><a name="d0e437"></a>A RENDRE LE 06 JANVIER 2002</h2></div></div><p>Soit, mardi 06 &agrave; 14h30. <b>Aucun retard ne sera admis.</b></p></div><div class="sect1"><div class="titlepage"><div><h2 class="title" style="clear: both"><a name="d0e444"></a>Le code source</h2></div></div><p>Format unix : <a href="genPaysage.tar.gz" target="_top"> genPaysage.tar.gz</a></p><p>Format windows : <a href="genPaysage.zip" target="_top"> genPaysage.zip</a></p><p>Format windows auto-extractible : <a href="genPaysage.zip" target="_top"> genPaysage.exe</a></p></div></div></body></html>